public class ShowName {
    //Написать метод, которому в качестве параметра передается строка, обозначающая имя.
    // Метод должен вывести в консоль сообщение «Привет, указанное_имя!».
    public static void main(String[] args) {
        showMane("Tom");
    }
    public static void showMane(String a){
        System.out.println("Hi, " + a);
    }
}
